       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-YEAR PIC 9(4).
       01 WS-RESULT PIC 9(1).
       01 WS-DUMMY PIC 9(4).

       01 WS-4 PIC 9(4).
       01 WS-100 PIC 9(4).
       01 WS-400 PIC 9(4).
       PROCEDURE DIVISION.
       LEAP.
         DIVIDE WS-YEAR BY 4 GIVING WS-DUMMY REMAINDER WS-4
         DIVIDE WS-YEAR BY 100 GIVING WS-DUMMY REMAINDER WS-100
         DIVIDE WS-YEAR BY 400 GIVING WS-DUMMY REMAINDER WS-400

         IF WS-4 = 0 THEN
            PERFORM IS-LEAP THRU LEAP-EXIT
         ELSE
            PERFORM LEAP-EXIT
         END-IF.

       IS-LEAP.
         MOVE 1 TO WS-RESULT
      
         IF WS-100 = 0 AND WS-400 > 1 THEN
            MOVE ZERO TO WS-RESULT
         END-IF.
      
       LEAP-EXIT.
         EXIT.
